# RebarSystemSpacingBackDirn2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemSpacingBackDirn2 Property
ParameterTypeId Class See Also
---
"Interior Minor Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemSpacingBackDirn2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemSpacingBackDirn2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemSpacingBackDirn2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace